Revit.Elements.Floor.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.Curve[],Revit.Elements.FloorType,Revit.Elements.Level)
Create a Revit Floor given its curve outline and Level
outlineCurves:
floorType:
level:
Returns: The floor

Revit.Elements.Floor.ByOutlineTypeAndLevel(Autodesk.DesignScript.Geometry.PolyCurve,Revit.Elements.FloorType,Revit.Elements.Level)
Create a Revit Floor given its curve outline and Level
outline:
floorType:
level:
Returns: The floor

Revit.Elements.Floor.Points
Get Slab Shape Points

Revit.Elements.Floor.AddPoint(Autodesk.DesignScript.Geometry.Point)
Add Point to Slab Shape

Revit.Elements.Floor.MovePoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Move an existing point in the slab shape editor by an offset.
Behaves as moving a point manually in the slab shape editor.